
//Второе домашние задание:
//№1 Создать программу, которая запрашивает у пользователя число, в консоль выводит числа от 1 до до этого числа, но пропускает числа, которые кратны (делятся без остатка) 4-м

/*
let userNum;
let i = 1;
do {
   userNum = prompt()
   if ( i === 4) continue;
}
   while ( i <= 21 ) {
      console.log(i);
      i++;
   }
*/
   
//№2 Написать программу, которая будет получать число и с помощью цикла while считать его факториал.
/*
let i = 3;
while (''); {
   i * ( i - 1 );
   console.log(i)
   i++
}
*/
/*
let i = 2;
while ( i < chislo) {
   let n = prompt('Введите число');
   n! = n * (n - 1) * (n - 2) * ...*1
   }
document.write("Число в факториале "+ chislo );
*/

// Подсказки
/*
for (;;) {
   let userNum = +prompt();
}
*/
/*
let i = 0;
   while ( i < 10 ){
   console.log(i);
   i++;
}
*/
//№3 Написать программу, которая будет получать число и его степень, с помощью цикла for возвести число в степень.То что попробовал сам так не смог догадаться...
/*
for ( let i = 1; i < 20; i++ ) {
   let = i ** i;
   console.log(i);
}
*/
// То что нашел в инете нужно понять, обсудить
/*
let chislo=prompt("Введите число", ""),
stepen=prompt("Введите степень","");
let result=1;

for (i=1; i<=stepen; i++){
result*=chislo;
}
document.write("Число в степени "+result);
*/

